app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "rjgonzalez6@gmail.com"], ["LIMIT", 1]]
---
	def create
		#complete this method
		u = User.where(email: params[:session][:email]).take