app/controllers/users_controller.rb

  def create
    #complete this method
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "last_name", "email", "phone", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    #complete this method
      respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "a@abc.c"], ["password", "poiuytrew"], ["updated_at", "2019-04-17 19:46:19.226891"], ["id", 5]]